src/DataProcessors/EMS_ПроверкаСинхронизации/EMS_ПроверкаСинхронизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>EMS_ПроверкаСинхронизации</name>
</mdclass:DataProcessor>

src/InformationRegisters/EMS_ОбъектыМетаданных/EMS_ОбъектыМетаданных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>EMS_ОбъектыМетаданных</name>
  <resources>
    <name>Выбран</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Представление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодУИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипУИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Иерархический</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Владелец</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПолеОрганизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОсновныеПоляДляСверки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДополнительныеПоляДляСверки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Вид</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПараметрыБазы</name>
    <type>
      <types>CatalogRef.EMS_ПараметрыБаз</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/DataProcessors/EMS_ПроверкаСинхронизации/Forms/Форма/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Логин = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("СинхронизацияEMS", "Логин");
	Пароль = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("СинхронизацияEMS", "Пароль");
	УстановитьНаименованиеПланаОбменаПоУмолчанию();
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	УстановитьНаименованиеПланаОбменаПоУмолчанию();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы
    
&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
КонецПроцедуры  

&НаКлиенте
Процедура КопироватьСтрокуДляВсехБаз(Команда)
	КопироватьСтрокуДляВсехБазНаСервере(); 
	Элементы.ОбъектыМетаданных.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСписокОбъектНеНайденДляБазы(Команда) 
	ТаблицаСообщений = Элементы.СообщенияСинхронизации;
	ТекущаяСтрока = ТаблицаСообщений.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗначениеБазы = ТекущаяСтрока.База;
	ТабДокумент = Новый ТабличныйДокумент;
	ПолучитьСписокОбъектНеНайденДляБазыНаСервере(ТабДокумент, ЗначениеБазы);
	ТабДокумент.Показать("Результаты обработки сообщений");

КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьКОбмену(Команда)

	ТекущаяСтрока = Элементы.СообщенияСинхронизации.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		ПоказатьПредупреждение(, "Выделите строку в сообщениях синхронизации.");
		Возврат;
	КонецЕсли;

	ТабДокумент = Новый ТабличныйДокумент;
	ЗарегистрироватьКОбменуНаСервере(ТабДокумент, ТекущаяСтрока.База);
	ТабДокумент.Показать("Результат регистрации объектов к обмену");

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМетаданные(Команда)

	Результат = ЗаполнитьМетаданныеНаСервере();

	Если Не Результат.ПланНайден Тогда
		ПоказатьПредупреждение(, СтрШаблон(
			"План обмена ""%1"" не найден. Укажите имя или синоним плана обмена.",
			НаименованиеПланаОбмена));
		Возврат;
	КонецЕсли;

	Если Результат.ДобавленоСтрок = 0 Тогда
		ПоказатьПредупреждение(, СтрШаблон(
			"Новые строки не добавлены: по всем базам уже заполнены все объекты метаданных плана обмена.
			|Обработано баз: %1, объектов метаданных: %2, пропущено по правилам обмена: %3.",
			Результат.Баз, Результат.ВсегоОбъектов, Результат.ПропущеноОбъектов));
	Иначе
		ПоказатьПредупреждение(, СтрШаблон(
			"Добавлено строк: %1.
			|Обработано баз: %2, объектов метаданных: %3, пропущено по правилам обмена: %4.",
			Результат.ДобавленоСтрок, Результат.Баз, Результат.ВсегоОбъектов, Результат.ПропущеноОбъектов));
	КонецЕсли;

	Элементы.ОбъектыМетаданных.Обновить();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗарегистрироватьКОбменуНаСервере(ТабДокумент, ЗначениеБазы)

	ТаблицаРезультата = EMS_ПроверкаСинхронизации.ЗарегистрироватьОбъектыКОбмену(ЗначениеБазы);

	ТабДокумент.Область("R1C1").Текст = "Результат регистрации объектов к обмену";
	ТабДокумент.Область("R2C1").Текст = "";
	ТабДокумент.Область("R3C1").Текст = "База: " + Строка(ЗначениеБазы);
	ТабДокумент.Область("R4C1").Текст = "";
	ТабДокумент.Область("R5C1").Текст = "№";
	ТабДокумент.Область("R5C2").Текст = "Объект";
	ТабДокумент.Область("R5C3").Текст = "ГУИД";
	ТабДокумент.Область("R5C4").Текст = "Результат";

	НомерСтроки = 0;
	ТекущаяСтрокаТД = 6;

	Для Каждого СтрокаРезультата Из ТаблицаРезультата Цикл

		НомерСтроки = НомерСтроки + 1;
		ТабДокумент.Область("R" + Формат(ТекущаяСтрокаТД, "ЧГ=0") + "C1").Текст = Строка(НомерСтроки);
		ТабДокумент.Область("R" + Формат(ТекущаяСтрокаТД, "ЧГ=0") + "C2").Текст = СтрокаРезультата.ПолноеИмяМетаданных;
		ТабДокумент.Область("R" + Формат(ТекущаяСтрокаТД, "ЧГ=0") + "C3").Текст = СтрокаРезультата.УникальныйИдентификатор;
		ТабДокумент.Область("R" + Формат(ТекущаяСтрокаТД, "ЧГ=0") + "C4").Текст = СтрокаРезультата.Результат;

		ТекущаяСтрокаТД = ТекущаяСтрокаТД + 1;

	КонецЦикла;

	ТабДокумент.АвтоМасштаб = Истина;

КонецПроцедуры

&НаСервере
Процедура УстановитьНаименованиеПланаОбменаПоУмолчанию()

	ЗаполнитьСписокПлановОбмена();

	ИмяПланаОбмена = СокрЛП(НаименованиеПланаОбмена);
	Если СписокПлановОбменаСодержит(ИмяПланаОбмена) Тогда
		НаименованиеПланаОбмена = ИмяПланаОбмена;
		Возврат;
	КонецЕсли;

	ПланОбмена = EMS_ПроверкаСинхронизации.ПланОбменаПоНаименованию(ИмяПланаОбмена);
	Если ПланОбмена <> Неопределено Тогда
		НаименованиеПланаОбмена = ПланОбмена.Имя;
		Возврат;
	КонецЕсли;

	Если СписокПлановОбменаСодержит("ОбменДаннымиZ") Тогда
		НаименованиеПланаОбмена = "ОбменДаннымиZ";
	ИначеЕсли Элементы.НаименованиеПланаОбмена.СписокВыбора.Количество() > 0 Тогда
		НаименованиеПланаОбмена = Элементы.НаименованиеПланаОбмена.СписокВыбора[0].Значение;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокПлановОбмена()

	СписокПланов = Элементы.НаименованиеПланаОбмена.СписокВыбора;
	СписокПланов.Очистить();

	Для Каждого ПланОбмена Из Метаданные.ПланыОбмена Цикл

		Представление = ПланОбмена.Представление();
		Если Не ЗначениеЗаполнено(Представление) Или Представление = ПланОбмена.Имя Тогда
			Представление = ПланОбмена.Имя;
		Иначе
			Представление = Представление + " (" + ПланОбмена.Имя + ")";
		КонецЕсли;

		СписокПланов.Добавить(ПланОбмена.Имя, Представление);

	КонецЦикла;

	СписокПланов.СортироватьПоПредставлению();

КонецПроцедуры

&НаСервере
Функция СписокПлановОбменаСодержит(ИмяПланаОбмена)

	Если Не ЗначениеЗаполнено(ИмяПланаОбмена) Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат Элементы.НаименованиеПланаОбмена.СписокВыбора.НайтиПоЗначению(ИмяПланаОбмена) <> Неопределено;

КонецФункции

&НаСервере
Функция ЗаполнитьМетаданныеНаСервере()

	Возврат EMS_ПроверкаСинхронизации.ЗаполнитьОбъектыМетаданныхПоПлануОбмена(НаименованиеПланаОбмена);

КонецФункции

&НаСервере
Процедура СохранитьНаСервере()
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище("СинхронизацияEMS", Логин, "Логин");
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище("СинхронизацияEMS", Пароль, "Пароль");
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСинхронизацию(Команда)
	ПроверитьСинхронизациюНаСервере();  
	Элементы.СообщенияСинхронизации.Обновить();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПроверитьСинхронизациюНаСервере()
	EMS_ПроверкаСинхронизации.ВыполнитьСинхронизацию(Истина);
КонецПроцедуры

&НаСервере
Процедура КопироватьСтрокуДляВсехБазНаСервере()
	КлючЗаписи = Элементы.ОбъектыМетаданных.ТекущаяСтрока;
	Если КлючЗаписи = Неопределено Тогда
		Возврат;	
	КонецЕсли;   
	МенеджерЗаписи = РегистрыСведений.EMS_ОбъектыМетаданных.СоздатьМенеджерЗаписи();
    ЗаполнитьЗначенияСвойств(МенеджерЗаписи, КлючЗаписи);
    МенеджерЗаписи.Прочитать();
	АктуальныеБазы = Справочники.EMS_ПараметрыБаз.СписокАктуальныхБаз();
	НаборЗаписей = РегистрыСведений.EMS_ОбъектыМетаданных.СоздатьНаборЗаписей();
	НаложитьОтборНаНаборЗаписей(НаборЗаписей, КлючЗаписи);  
	ЗаполнитьНаборЗаписей(НаборЗаписей, АктуальныеБазы, МенеджерЗаписи);
	НаборЗаписей.Записать(РежимЗамещения.Слияние);
КонецПроцедуры    

Процедура НаложитьОтборНаНаборЗаписей(НаборЗаписей, КлючЗаписи)
	МетаданныеРегистра = Метаданные.РегистрыСведений.EMS_ОбъектыМетаданных;
	Для Каждого Измерение Из МетаданныеРегистра.Измерения Цикл
		Если Измерение.Имя <> "ПараметрыБазы" И КлючЗаписи[Измерение.Имя] <> Неопределено Тогда
			НаборЗаписей.Отбор[Измерение.Имя].Установить(КлючЗаписи[Измерение.Имя]);
		КонецЕсли;
	КонецЦикла;		
КонецПроцедуры  

Процедура ЗаполнитьНаборЗаписей(НаборЗаписей, АктуальныеБазы, МенеджерЗаписи) 
	Для Каждого ПараметрыБазы Из АктуальныеБазы Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.ПараметрыБазы = ПараметрыБазы;
		ЗаполнитьЗначенияСвойств(НоваяЗапись, МенеджерЗаписи, , "ПараметрыБазы");
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокОбъектНеНайденДляБазыНаСервере(ТабДокумент, ЗначениеБазы)	

	ТабДокумент.Область("R1C1:R1C4").Объединить();
	ТабДокумент.Область("R1C1").Текст = "Результаты обработки сообщений синхронизации";
	ТабДокумент.Область("R2C1").Текст = "";
	ТабДокумент.Область("R3C1:R3C4").Объединить();
	ТабДокумент.Область("R3C1").Текст = "База: " + ЗначениеБазы;
	ТабДокумент.Область("R4C1").Текст = "";
	ТабДокумент.Область("R5C1").Текст = "№";
	ТабДокумент.Область("R5C2").Текст = "Извлеченное сообщение";
	ТабДокумент.Область("R5C3").Текст = "Вид объекта метаданных";
	ТабДокумент.Область("R5C4").Текст = "Представление";
	ТабДокумент.Область("R6C1").Текст = "";
	
	РегулярноеВыражение = "<Объект не найден> \([^)]*\)";
	ДобавленныеСообщения = Новый Соответствие;
	Фрагменты = Новый Массив;
	СообщенияБезСсылки = Новый Массив;
	
	ИсполняемаяСхема = Элементы.СообщенияСинхронизации.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	ИсполняемыеНастройки = Элементы.СообщенияСинхронизации.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ИсполняемыеНастройки.Отбор,
		"База",
		ЗначениеБазы,
		ВидСравненияКомпоновкиДанных.Равно);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(ИсполняемаяСхема, ИсполняемыеНастройки, , , 
		Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Для Каждого СтрокаТаблицы Из ТаблицаРезультат Цикл
		
		ТекстСообщения = СтрокаТаблицы.Сообщение;
		РезультатПоиска = СтрНайтиВсеПоРегулярномуВыражению(ТекстСообщения, РегулярноеВыражение);
		ЕстьФрагмент = Ложь;
		
		Если РезультатПоиска <> Неопределено Тогда
			
			Для Каждого Совпадение Из РезультатПоиска Цикл
				
				ЕстьФрагмент = Истина;
				НайденнаяПодстрока = Сред(ТекстСообщения, Совпадение.НачальнаяПозиция, Совпадение.Длина);
				Если ДобавленныеСообщения.Получить(НайденнаяПодстрока) <> Неопределено Тогда
					Продолжить;
				КонецЕсли;
				ДобавленныеСообщения.Вставить(НайденнаяПодстрока, Истина);
				Фрагменты.Добавить(НайденнаяПодстрока);
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если Не ЕстьФрагмент И ЗначениеЗаполнено(ТекстСообщения)
			И ДобавленныеСообщения.Получить(ТекстСообщения) = Неопределено Тогда
			ДобавленныеСообщения.Вставить(ТекстСообщения, Истина);
			СообщенияБезСсылки.Добавить(Новый Структура(
				"Тип, Вид, Сообщение", СтрокаТаблицы.Тип, СтрокаТаблицы.Вид, ТекстСообщения));
		КонецЕсли;
		
	КонецЦикла;

	Описания = EMS_ПроверкаСинхронизации.ОписанияОбъектовНеНайден(ЗначениеБазы, Фрагменты);
	ТаблицаСтрок = Новый ТаблицаЗначений;
	ТаблицаСтрок.Колонки.Добавить("Фрагмент", Новый ОписаниеТипов("Строка"));
	ТаблицаСтрок.Колонки.Добавить("ВидМетаданных", Новый ОписаниеТипов("Строка"));
	ТаблицаСтрок.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));

	Для Каждого Фрагмент Из Фрагменты Цикл
		Описание = Описания.Получить(Фрагмент);
		СтрокаОтчета = ТаблицаСтрок.Добавить();
		СтрокаОтчета.Фрагмент = Фрагмент;
		Если Описание <> Неопределено Тогда
			СтрокаОтчета.ВидМетаданных = Описание.ВидМетаданных;
			СтрокаОтчета.Представление = Описание.Представление;
		КонецЕсли;
	КонецЦикла;

	Для Каждого СообщениеБезСсылки Из СообщенияБезСсылки Цикл
		СтрокаОтчета = ТаблицаСтрок.Добавить();
		СтрокаОтчета.Фрагмент = ТекстСообщенияБезОтбора(СообщениеБезСсылки.Сообщение);
		СтрокаОтчета.ВидМетаданных = ВидМетаданныхСообщения(СообщениеБезСсылки.Тип, СообщениеБезСсылки.Вид);
		СтрокаОтчета.Представление = ПредставлениеКлючаСообщения(СообщениеБезСсылки.Сообщение);
	КонецЦикла;
	ТаблицаСтрок.Сортировать("ВидМетаданных, Фрагмент");

	НомерСтроки = 0;
	ТекущаяСтрокаТД = 7;
	Для Каждого СтрокаОтчета Из ТаблицаСтрок Цикл
		НомерСтроки = НомерСтроки + 1;
		ТабДокумент.Область("R" + Формат(ТекущаяСтрокаТД, "ЧГ=0") + "C1").Текст = Строка(НомерСтроки);
		ТабДокумент.Область("R" + Формат(ТекущаяСтрокаТД, "ЧГ=0") + "C2").Текст = СтрокаОтчета.Фрагмент;
		ТабДокумент.Область("R" + Формат(ТекущаяСтрокаТД, "ЧГ=0") + "C3").Текст = СтрокаОтчета.ВидМетаданных;
		ТабДокумент.Область("R" + Формат(ТекущаяСтрокаТД, "ЧГ=0") + "C4").Текст = СтрокаОтчета.Представление;
		ТекущаяСтрокаТД = ТекущаяСтрокаТД + 1;
	КонецЦикла;

	УстановитьШиринуКолонокПоСодержимому(ТабДокумент, 5, 4);
	ТабДокумент.АвтоМасштаб = Ложь;

КонецПроцедуры

&НаСервере
Функция ВидМетаданныхСообщения(Тип, Вид)

	ИменаКоллекций = Новый Соответствие;
	ИменаКоллекций.Вставить("Справочники", "Справочник");
	ИменаКоллекций.Вставить("Документы", "Документ");
	ИменаКоллекций.Вставить("РегистрыСведений", "РегистрСведений");
	ИменаКоллекций.Вставить("РегистрыНакопления", "РегистрНакопления");
	ИменаКоллекций.Вставить("РегистрыБухгалтерии", "РегистрБухгалтерии");
	ИменаКоллекций.Вставить("РегистрыРасчета", "РегистрРасчета");
	ИменаКоллекций.Вставить("ПланыВидовХарактеристик", "ПланВидовХарактеристик");

	ИмяКоллекции = ИменаКоллекций.Получить(Тип);
	Если ИмяКоллекции = Неопределено Тогда
		ИмяКоллекции = Тип;
	КонецЕсли;

	ПолноеИмя = ИмяКоллекции + "." + Вид;
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ПолноеИмя);
	Если ОбъектМетаданных = Неопределено Тогда
		Возврат ПолноеИмя;
	КонецЕсли;

	Синоним = ОбъектМетаданных.Представление();
	Если Не ЗначениеЗаполнено(Синоним) Тогда
		Возврат ПолноеИмя;
	КонецЕсли;

	Возврат Синоним + " (" + ПолноеИмя + ")";

КонецФункции

&НаСервере
Функция ТекстСообщенияБезОтбора(ТекстСообщения)

	Позиция = СтрНайти(ТекстСообщения, "#ОТБОР#");
	Если Позиция = 0 Тогда
		Возврат ТекстСообщения;
	КонецЕсли;
	Возврат СокрП(Лев(ТекстСообщения, Позиция - 1));

КонецФункции

&НаСервере
Функция ПредставлениеКлючаСообщения(ТекстСообщения)

	Текст = ТекстСообщенияБезОтбора(ТекстСообщения);
	Префикс = "В<Л|";
	Если СтрНачинаетсяС(Текст, Префикс) Тогда
		Текст = Сред(Текст, СтрДлина(Префикс) + 1);
	КонецЕсли;

	Части = СтрРазделить(Текст, "|", Ложь);
	Значения = Новый Массив;
	Для Каждого Часть Из Части Цикл
		Часть = СокрЛП(Часть);
		Если СтрЗаканчиваетсяНа(Часть, ",") Тогда
			Часть = СокрЛП(Лев(Часть, СтрДлина(Часть) - 1));
		КонецЕсли;
		Если ЗначениеЗаполнено(Часть) Тогда
			Значения.Добавить(Часть);
		КонецЕсли;
	КонецЦикла;

	Возврат СтрСоединить(Значения, "; ");

КонецФункции

&НаСервере
Процедура УстановитьШиринуКолонокПоСодержимому(ТабДокумент, НомерПервойСтроки, КоличествоКолонок)

	ВысотаТаблицы = Макс(ТабДокумент.ВысотаТаблицы, НомерПервойСтроки);

	Для НомерКолонки = 1 По КоличествоКолонок Цикл

		МаксимальнаяДлина = 0;
		Для НомерСтроки = НомерПервойСтроки По ВысотаТаблицы Цикл
			ДлинаТекста = СтрДлина(СокрЛП(ТабДокумент.Область(НомерСтроки, НомерКолонки).Текст));
			МаксимальнаяДлина = Макс(МаксимальнаяДлина, ДлинаТекста);
		КонецЦикла;

		ШиринаКолонки = МаксимальнаяДлина + 2;
		Если ШиринаКолонки < 4 Тогда
			ШиринаКолонки = 4;
		КонецЕсли;

		ОбластьКолонки = ТабДокумент.Область(НомерПервойСтроки, НомерКолонки, ВысотаТаблицы, НомерКолонки);
		ОбластьКолонки.ШиринаКолонки = ШиринаКолонки;
		ОбластьКолонки.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;

	КонецЦикла;

КонецПроцедуры
#КонецОбласти
